turbinesFoam/tests/nacelleSurface/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains 2;

// Split in the streamwise direction: the processor boundary at x = 0.5
// crosses the plate's kernel support, exercising cross-rank distribution and
// interpolation
method          simple;

simpleCoeffs
{
    n               (2 1 1);
    delta           0.001;
}

// ************************************************************************* //
