turbinesFoam/tests/nacelleSurface/system/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Standalone nacelle actuator surface source (no turbine): the plate is a
// two-triangle surface with uniform outward normal (1 0 0) placed in a
// uniform cubic mesh, so the expected force is known analytically.

nacelle
{
    type            nacelleSurfaceSource;
    active          true;

    nacelleSurfaceSourceCoeffs
    {
        fieldNames          (U);
        selectionMode       cellSet;
        cellSet             nacelleCells;

        geometry            "geometry/plate.stl";
        referenceVelocity   1.0;
        rho                 1.0;
        nu                  1.0e-3;
        cfModel             constant;
        cf                  0.01;
        bodyOrigin          (0 0 0);
        bodyAxis            (1 0 0);
        referenceArea       0.04;
        writeForceField     true;
        writePerf           true;
        writeNodePerf       true;
    }
}

// ************************************************************************* //
